{"Coursera/Google-Project-Management-Course/Course-1/Course-1-Module-3":{"slug":"Coursera/Google-Project-Management-Course/Course-1/Course-1-Module-3","filePath":"Coursera/Google Project Management Course/Course 1/Course 1 Module 3.md","title":"Course 1 Module 3","links":[],"tags":["project_management","coursera"],"content":"2025-05-14 11:47\nProject Lifecycle:\nInitiate the Project\n\ndefine project goals\ndetermine resources, people, and other project details\nget approval from management\n\nMake a Plan\n\ncreate a budget\nset the schedule\nestablish your team, determine roles and responsibilities\nplan for risk and change\n\nExecute and Complete Tasks\n\nmanage progress\ncommunicate (err on the side of over-communication)\nmake adjustments\n\nClose Project\n\ncheck to make sure all tasks have been completed\nconfirm acceptance of the project outcome\nreflect on lessons learned (retrospective)\nshare final results with stakeholders (including all documentation)\ncelebrate!\nformally move on from the project.\n\nProject Management Methodology\n\nLinear! One step at a time. Final result is unlikely to change.\nIterative - different tasks can be in progress simultaneously, end result can change throughout. Allows for flexibility and expects changes\n\nWaterfall\nThis is linear, and is used from construction to product and app design. There are many styles as well.\nThe process for waterfall mirrors that of a project lifecycle.\nIt is utilized when the phases of the project are clearly defined and most tasks must be completed before moving on to the next one. Also when making changes expensive. There are still ways to manage risk though.\n\nchanges go through a formal request process\n\nAgile\nThis is iterative, and movies quickly, with changes made frequently and easily. Usually phases overlap and tasks are completed in iterations.\nGood for when the result is not clearly defined, but the customer has a list of qualities or some idea of what they want it to look like.\nAlso good for when uncertainty and risk are high.\n\nprogress towards milestone is dependent on stakeholder feedback\n\nLean Six Sigma\nThis is a fusion of Lean and Six Sigma, which is utilized when the goals are to save money, improve quality, and move through processes quickly. Also focuses on team collaboration.\nThe five phases for this are:\nDefine - tells you what to measure\nMeasure - tells you what to analyze\nAnalyze - tells you what to improve\nImprove - tells you what to control\nControl - monitoring the project and ensuring quality\nDMAIC be applied to any business problem!\nLean helps limit resources, reduce waste, and streamline processes to maximize benefits. The 5S quality tool:\n\nSort: remove unneeded items\nSet in order - arrange and label items so they are easy to use\nShine - keep the workspace clean and items in their proper place\nStandardize - perform the process the same way each time\nSustain - make a habit of maintaining correct procedures and instill this discipline in your team\n\nIt also uses a Kaban board to help monitor progress, which categorizes tasks into To Do, In Progress, Testing, and Done.\nSix Sigma reduces variations by ensuring quality procedures are followed every time.\n\nFocus on the customer\nIdentify and understand the work itself, and how it gets done\nMake your processes flow smoothly\nReduce waste and concentrate on value\nStop defects by removing variation\nInvolve and collaborate with your team\nApproach improvement and activity in a systematic way.\n\nFor some reason there are seven principles. The seem kind of abstract and arbitrarily arranged.\nScrum is an Agile framework that focuses on developing, delivering, and sustaining complex projects and products with small cross-functional teams lead by a Scrum Master. Short deliverables\nDifferentiating qualities between LeanSixSigma and Scrum seems difficult.\nLSS is more long term, Scrum is shorter development sprints for iterative design\nReference"},"index":{"slug":"index","filePath":"index.md","title":"Welcome to Quartz","links":[],"tags":[],"content":"This is a blank Quartz installation.\nSee the documentation for how to get started."}}