{"Coursera/Google-Project-Management-Course/Course-1/Course-1-Module-1---Intro-to-Project-Management":{"slug":"Coursera/Google-Project-Management-Course/Course-1/Course-1-Module-1---Intro-to-Project-Management","filePath":"Coursera/Google Project Management Course/Course 1/Course 1 Module 1 - Intro to Project Management.md","title":"Course 1 Module 1 - Intro to Project Management","links":[],"tags":["project_management","coursera"],"content":"2025-05-08 16:22\nCareer Identity - the unique value that you bring to the workforce, informed by who you are and what you have to offer, now and in the future\nmade up of:\n\nyour strengths - I’m a people person, an effective communicator. I’m cooperative and creative. I’m an intermediate illustrator, amateur musician, and a graphic design graduate, and have a knack for visualizing ideas. I’m detail oriented and love a challenge.\nyour motivations - I love helping people resolve problems and being able to provide assistance and find solutions. I love storytelling and expressive works of art, especially animation and music. I want to make things that are evocative and stylish, while remaining authentic. I’m driven to do my best in whatever I set out to do, and make something I can be proud of each time.\nyour values - I value authenticity, honesty, and integrity. I strive to achieve sustainability and efficiency.\n\nCareer Identity Statement:\nI am an artist and office worker with 3 years of experience doing administrative, organizational, and detail oriented work. My greatest strength is interpersonal communication, and I have a talent for helping people understand unfamiliar ideas. I’m passionate about helping others, and I value authenticity and integrity.\nWhat is a “project”?\nIt’s a unique endeavor, with unique deliverables.\nIt’s temporary, with a beginning and an end.\nit involves planning, organizing, budgeting, and communicating.\nIt’s a project manager’s job to make sure the project is both valuable and successful.\nManufacturing, construction, IT, publishing, finance, oil and gas are all industries that are experiencing growth in project manager positions.\nProject Manager &gt; Program Manager &gt; Portfolio Manager\nMy dad’s view and opinion of me is very narrow and limited.\n*Missed milestone is not a failure, but data that needs to be addressed and reevaluated.\nReference\nCoursera.org"},"Coursera/Google-Project-Management-Course/Course-1/Course-1-Module-2---Core-Skills":{"slug":"Coursera/Google-Project-Management-Course/Course-1/Course-1-Module-2---Core-Skills","filePath":"Coursera/Google Project Management Course/Course 1/Course 1 Module 2 - Core Skills.md","title":"Course 1 Module 2 - Core Skills","links":[],"tags":["project_management","coursera"],"content":"2025-05-13 11:34\nThis feels a little dumb.\nProject managers add value to their teams! Wow!\nPrioritization: they help their team break down large tasks into smaller steps\nSometimes I don’t feel like I’m good at this step, but the house painting example sounds like one I would be very good at. I’d consider all the things the lecturer mentioned, because I’m obsessive about making sure anything permanent is done properly.\nDelegation is utilizing people and their strengths for the jobs they are the best fit for.\nCommunication and checking in regularly and staying in contact is key! Keep people informed.\nJuAnne’s experience sounds like something I would enjoy.\nCustomers can be internal and external.\nInternal: stakeholders like management, team members, resource managers, organizational department\nExternal: clients, contractors, suppliers, consumers\nGoals centered around the customer. The team is the project’s greatest asset. Fostering relationships through communication makes people feel valued. Managing the project also involves clearly communicating everyone’s roles and their impact. Manage quality by mitigating risks as they change and new ones come up. Ask for input and suggestions from your team about how to build towards your goal; this will let them use their voice and help foster an environment of accountability and responsibility, and likely make the team feel closer.\nA cross-functional team has a diverse skillset but works towards a shared goal.\nCore Skills\nEnabling Decision-Making: gathering info so that you and your team can make informed decisions, and communicating these decisions to all relevant parties\nCommunicating and Escalating: staying in touch and making sure everyone is working from the same plan, and bringing risks and issues to the attention of stakeholders when appropriate. When escalating, try to approach management with the problem and the solution, or at least suggestions.\nFlexibility: ability to adjust to unforeseen changes in conditions.\n\nAssess external constraints\nPlan for risks and challenges\nCalculate “float” in your schedule\n\nStrong Organizational Skills: Tracking tasks and progress towards the goal, and the needs of the team and the project each step of the way\nInterpersonal Skills:\n\nCommunication\nNegotiation\nConflict Mediation\nUnderstanding motivations\n\nbonus ones: Active listening, Shifting perspectives\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-1/Course-1-Module-3---Project-Lifecycle":{"slug":"Coursera/Google-Project-Management-Course/Course-1/Course-1-Module-3---Project-Lifecycle","filePath":"Coursera/Google Project Management Course/Course 1/Course 1 Module 3 - Project Lifecycle.md","title":"Course 1 Module 3 - Project Lifecycle","links":[],"tags":["project_management","coursera"],"content":"2025-05-14 11:47\nProject Lifecycle:\nInitiate the Project\n\ndefine project goals\ndetermine resources, people, and other project details\nget approval from management\n\nMake a Plan\n\ncreate a budget\nset the schedule\nestablish your team, determine roles and responsibilities\nplan for risk and change\n\nExecute and Complete Tasks\n\nmanage progress\ncommunicate (err on the side of over-communication)\nmake adjustments\n\nClose Project\n\ncheck to make sure all tasks have been completed\nconfirm acceptance of the project outcome\nreflect on lessons learned (retrospective)\nshare final results with stakeholders (including all documentation)\ncelebrate!\nformally move on from the project.\n\nProject Management Methodology\n\nLinear! One step at a time. Final result is unlikely to change.\nIterative - different tasks can be in progress simultaneously, end result can change throughout. Allows for flexibility and expects changes\n\nWaterfall\nThis is linear, and is used from construction to product and app design. There are many styles as well.\nThe process for waterfall mirrors that of a project lifecycle.\nIt is utilized when the phases of the project are clearly defined and most tasks must be completed before moving on to the next one. Also when making changes expensive. There are still ways to manage risk though.\n\nchanges go through a formal request process\n\nAgile\nThis is iterative, and movies quickly, with changes made frequently and easily. Usually phases overlap and tasks are completed in iterations.\nGood for when the result is not clearly defined, but the customer has a list of qualities or some idea of what they want it to look like.\nAlso good for when uncertainty and risk are high.\n\nprogress towards milestone is dependent on stakeholder feedback\n\nLean Six Sigma\nThis is a fusion of Lean and Six Sigma, which is utilized when the goals are to save money, improve quality, and move through processes quickly. Also focuses on team collaboration.\nThe five phases for this are:\nDefine - tells you what to measure\nMeasure - tells you what to analyze\nAnalyze - tells you what to improve\nImprove - tells you what to control\nControl - monitoring the project and ensuring quality\nDMAIC be applied to any business problem!\nLean helps limit resources, reduce waste, and streamline processes to maximize benefits. The 5S quality tool:\n\nSort: remove unneeded items\nSet in order - arrange and label items so they are easy to use\nShine - keep the workspace clean and items in their proper place\nStandardize - perform the process the same way each time\nSustain - make a habit of maintaining correct procedures and instill this discipline in your team\n\nIt also uses a Kaban board to help monitor progress, which categorizes tasks into To Do, In Progress, Testing, and Done.\nSix Sigma reduces variations by ensuring quality procedures are followed every time.\n\nFocus on the customer\nIdentify and understand the work itself, and how it gets done\nMake your processes flow smoothly\nReduce waste and concentrate on value\nStop defects by removing variation\nInvolve and collaborate with your team\nApproach improvement and activity in a systematic way.\n\nFor some reason there are seven principles. The seem kind of abstract and arbitrarily arranged.\nScrum is an Agile framework that focuses on developing, delivering, and sustaining complex projects and products with small cross-functional teams lead by a Scrum Master. Short deliverables\nDifferentiating qualities between LeanSixSigma and Scrum seems difficult.\nLSS is more long term, Scrum is shorter development sprints for iterative design\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-1/Course-1-Module-4---Organizational-Structure":{"slug":"Coursera/Google-Project-Management-Course/Course-1/Course-1-Module-4---Organizational-Structure","filePath":"Coursera/Google Project Management Course/Course 1/Course 1 Module 4 - Organizational Structure.md","title":"Course 1 Module 4 - Organizational Structure","links":[],"tags":["coursera","project_management"],"content":"2025-06-17 09:48\nOrganizational Structure\nOrganizational structure helps you understand where you fit in, who to communicate with, and how frequently.\nCommonly mapped out using an org chart, showing the relationships of people and groups within the organization, and who reports to who.\nClassic Structure is a typical top-down system of reporting, like a chain of command.\nMatrix Structure has people directly above you, but also people laterally from other departments/programs that need your reports for their work.\nLooks to me like siloed columns vs a table with columns and rows.\nProject Management Office (PMO):\nA group within an organization that sets and defines project management standards and processes in the organization. It often acts as a coordinated center for all of the organization’s projects. They offer guidance and support to the project managers.\nFunctions:\n- Strategic planning and governance\n- Best practices\n- Common project culture\n- Resource management\n- Creation of project documentation archives, and tools\nA PMO’s basic functions are:\n\nStrategic planning and governance\n\nThe most important one; this involves defining project criteria, selecting projects according to the org’s business goals, and then providing a business case for those projects to the management team.\n\n\nBest Practices\n\nprocess guidance, lessons previously learned,\n\n\nCommon project culture\n\nsetting the culture for new employees to work effectively in the organization\n\n\nResource management\n\nproviding training, mentoring, coaching to all employees, especially PMs, and helping define roles and responsibilities while allocating resources\n\n\nCreation of project documentation, archives, and tools\n\nproviding templates, tools, and software to manage projects and maintain the org’s project history\n\n\n\nOrganizational Culture\nA company’s culture is really important! Asking about the company’s culture at an interview is a great way to get more info about the company and shows you understand how big of an impact it can have on a project.\nAsk questions. What’s going well? What do your peers think should change? Make observations, like what people like and respect about the company’s culture. Understand your impact.\nThe Importance of organizational culture\nIdentity\ndescribes the way the company does business, hand in hand with the company’s values. You can think of this as a company’s personality, giving insight into what the company believes and how it will behave.\nPeople\nCulture can help retain a company’s best employees, while attracting great people too. People who feel valued, engaged, and challenged are more likely to perform better and drive for success.\nProcesses\nA company’s culture almost always reflects on the way it works, internally and externally, and in turn the way the company does business inside and outside affects the culture. If a company values feedback, opportunities for clients and employees to comment will be incorporated into the process.\nAs a project manager, understanding the company&#039;s culture helps navigate departmental interactions and communicate more effectively.\n“What are the top 3 challenges you want to solve today?”\nHelp your team determine what success looks like for each week.\nUnderstanding Change Management\nYou completed your project. Yay! Now what?\nHaving others adopt it is the first step to it having an effect on the org’s processes. This is change management!\n**Core Concepts:\n\ncreating a sense of ownership and urgency (getting others to feel like they are empowered to take responsibility for the successful completion of their tasks, and that the project is important and what is required for progress)\nFinding the right combination of skills and personalities\nEffective communication. This is key!\n\nSome good practices:\n\nbe proactive\ncommunicate about upcoming changes\nfollow a consistent process\npractice empathy\nuse tools like feedback mechanisms, flowcharts, and culture maps\n\nGovernance in business is the framework within which decisions are made and accountability and responsibility are determined.\nHow to uncover job opportunities!\nAnalyze job listings: collect a number of job descriptions and rank the frequency of each requirement.\nCreate a professional inventory: a comprehensive list of technical skills, interpersonal skills, personal qualities, and education.\nMatch your profile to the job requirements\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-2/Course-2-Module-1-and-2---Project-Initiation;-Identifying-Project-Goals":{"slug":"Coursera/Google-Project-Management-Course/Course-2/Course-2-Module-1-and-2---Project-Initiation;-Identifying-Project-Goals","filePath":"Coursera/Google Project Management Course/Course 2/Course 2 Module 1 and 2 - Project Initiation; Identifying Project Goals.md","title":"Course 2 Module 1 and 2 - Project Initiation; Identifying Project Goals","links":[],"tags":["project_management","coursera"],"content":"2025-06-17 09:52\nModule 1: Project Initiation\nIt’s the first step, so it’s important that you set yourself up for success!\nRecap: It’s a project managers responsibility to identify the project’s goals, resources, and other details, based on discussion with the project stakeholders.\nInitiation is an opportunity to gain clarity on expectations, which will save a lot of time for everyone throughout the project.\nConsiderations for Cost Benefit Analysis:\n\nvalue created\nreduced costs\nincreased profit\ntime saved\nimproved user experienced\nBalance these with…\ntime investment\none-time costs\nongoing costs\nlong-term costs\n\nAlso considerable are intangible benefits!\n\ncustomer satisfaction\nemployee satisfaction\nemployee productivity\nbrand perception\n…As well as intangible costs, like employee retention, or any of the above benefits.\n\nI&#039;m very glad these are mentioned. Sometimes the intangible is difficult to describe, but can be very important.\nKey components of project initiation:\n\nGoals - what you’ve been asked to do and what you’re trying to achieve\nScope - defining the work that needs to get done to complete the project\nDeliverables - products and services that you will create for the client\nSuccess Criteria - the standards by which you measure how successful a project was\nStakeholders - the people who have an interest in and are affected by the completion and success of the project\nResources - budget, people, and materials you have at your disposal\nInteresting that they ordered these this way, with resources on the bottom...\n\nA project charter is a framework for you to organize and clarify all these details and communicate them to others.\nIt’s important to build you “listening to learn” muscle.\n(G-C) / C = ROI\nROI is interesting. At first it seems strange, but then it makes sense.\nModule 2 - Identifying project goals\nRACI chart?\nSMART goals:\nSpecific\nWhat do I want to accomplish? Why is this a goal? Who is involved? Where should it be delivered? To what degree?\nMeasurable\nHow much/how many? How can you know it is accomplished?\nAttainable\nCan it be reasonably reached? How can it be accomplished?\nRelevant\nDoes this goal make sense? Is it worthwhile? Is it the right time?\nTime-bound\nHas a deadline or a clear timeframe\nObjectives and Key Results: combining a goal and a metric to determine a measurable outcome.\nCompany level OKRs are shared across an organization so that everyone can align and focus to help the company reach its goals.\nProject level OKRs help define measurable project goals, and need to align with both company and department level OKRs.\nProject Scope: the boundaries of a project\nScope-defining questions should be posed in these contexts:\n\nStakeholders\nGoals\nDeliverables\nResources\nBudget\nSchedule\nFlexibility\nMake sure to define who, what, when, why, and how.\n\nOut-of-scope: tasks that are not included in the project plan and don’t contribute to the goal\nScope-creep: changes/growth/uncontrolled factors that affect a project’s scope at any point after the project begins\nTo help avoid scope-creep,\n\nmake project plans visible\nget clarity on project requirements\nset ground rules and expectations for stakeholder involvement\ncreate a plan for dealing with out-of-scope requests\nput your agreements and plans in writing\n\nImportant:\nAny change outside of a project scope comes off the bottom line, and it is your job as a project manager to maintain the boundaries of the project. The best defense is to know all of the project’s ins and outs.\nBest practices to help control scope creep:\n\nDefine project requirements\nSet a clear project schedule\nDetermine what is out of scope\nProvide alternatives\nSet up a change control process\nLearn how to say no\nCollect costs of out-of-scope work\nThese points are very sequential!\n\nThere is a balance between scope, time, and costs, in the shape of a triangle. Kind of like balancing time, cost, and quality. Or like geometry! Changing one area will have a direct effect on one or more of the others. There is always a tradeoff.\nDocument everything beforehand and make sure everyone (team and stakeholders) is in agreement on the scope before the start of the project.\nLaunching and Landing\nproperly delivering the project and tracking the results after the product has been in use\nDon’t launch and forget! It is relieving to hand your project over to the client and celebrate completion, but ensuring the project’s success means you need to see if it meets the success criteria you laid out beforehand, or is on track to meet them.\nBaking a cake isn&#039;t enough to tell whether you did a good job- someone has to taste it and confirm.\nTo determine a project’s success criteria…\n\nIdentify measurable aspects of your project\nGet clarity from stakeholders on project requirements and expectations (key!)\nDocument and share all the info so that the team and stakeholders can refer to it later.\n\nThe metric(s) you choose must be as closely aligned to the project goal as possible. Satisfaction, adoption, and engagement are some ways of measuring success.\nIt&#039;s smart to measure success while the project/product is in progress. This can be done by having your team complete checklists for progress meetings, or hold live feedback sessions with users/customers.\nMethods for measuring criteria for success should include how, when (how often), and who. Defining success criteria should create greater alignment in the team and give everyone better visibility of how to achieve success. Remember SMART goals!\nReference\ncoursera.org, my brain"},"Coursera/Google-Project-Management-Course/Course-2/Course-2-Module-3---Working-Effectively-with-Stakeholders":{"slug":"Coursera/Google-Project-Management-Course/Course-2/Course-2-Module-3---Working-Effectively-with-Stakeholders","filePath":"Coursera/Google Project Management Course/Course 2/Course 2 Module 3 - Working Effectively with Stakeholders.md","title":"Course 2 Module 3 - Working Effectively with Stakeholders","links":[],"tags":["project_management","coursera"],"content":"2025-06-18 16:23\nExploring project team roles and responsibilities\nAccessibility, for project managers\nOver one billion people have a disability, and many disabilities are not immediately visible.\nWhen you create solutions for persons with disabilities, you are not only serving the critical audience of people with permanent disabilities, you are also unlocking secondary benefits for everyone who may move in and out of disability over time.\nExamples of accessibility we don’t immediately think about:\n\nmobile voice assistant\nspeech to text\nclosed captions\n…And ones that have become commonplace!\nremote control\ntypewriter/keyboard\noffice scanner\nSMS text messages\nelevator\n\nThe fact that they included this makes me happy and hopeful.\nChoosing the right team\nConsider…\n\nRequired roles\nTeam size\nNecessary skills - these can be taught, but make sure it is done in a timely fashion!\nAvailability\nMotivation - surprising, but important!\n\nFixed Roles:\n\nProject sponsor\nTeam member\nUser\nStakeholder\nProject manager - you!\n\nA project sponsor initiates the project and is responsible for presenting a business case for its existence.\nThey advocate for alignment with senior management, advise on key business decisions, and approve budget and resources.\nIt’s important to understand people in context.\n“The most important part of program management is understanding the personalities of the people you work with so that you can tailor your approach to make sure you’re working effectively with them.”\nThis is why it’s important to have a flexible approach!\nEvaluating Stakeholders\nStakeholders range from active to passive depending on the project, and steering committees may not be necessary for all of them.\nCompleting a Stakeholder Analysis:\n\nMake a list of all the stakeholders that the project impacts\nDetermine the level of interest and influence for each stakeholder\nAssess stakeholders’ ability to participate and then find ways to involve them\n==Interest refers to how much the stakeholder’s needs are affected by the project operations and outcomes\n\nThe important of a stakeholder depends on how high their interest and influence is. Those with the highest are called key stakeholders, without whose help the project would be unlikely to successfully land.\nA “power grid” can help plan how to best manage stakeholders.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n^^^21influence43interest&gt;&gt;&gt;\n\nKey stakeholders; collaborate with them closely.\nHigh influence, low interest; meet their needs. (i.e. Director of Product)\nHigh interest, low influence; show consideration for them. (i.e. customer success team)\nLow influence, low interest; they still matter! They’re just less integral to the daily process. You just want to monitor them.\n\nThe key stakeholders with the most influence and interest typically have the power to change the budget and approve updates to the timeline or scope. They are Big Boss.\nWhile they aren’t part of the steering committee, the PM is responsible for gathering and providing all the necessary information for decisions to be made quickly.\nStakeholder buy-in\nThe process of involving stakeholders in the project’s decision making with the goal of reaching a broader consensus on the organization’s future.\nThis requires different styles of engagement and involvement depending on the person and situation, so choose accordingly.\nTips for gaining buy-in:\n\nClearly mapping out the work of the project to the goals of the stakeholder\nDescribing how the project aligns with their goals\nListening to feedback and finding ways to incorporate it into the project’s charter where appropriate\nSuggested questions for stakeholders:\nWhat are your top priorities/goals?\nHow will this initiative/project support you and your goals?\nWhat role would you like to play in this project?\nHere’s how I plan to keep people informed… Does that work for you?\nWhat can I clarify?\nWhat are your expectations? What would you like this project to accomplish?\nWhat does success look like for you?\nAnyone else you would recommend I reach out to about this initiative?\nWhat info or insights do you have that might be challenging for me to find?\nWhere do you see me getting support or running into resistance?\nAny additional thoughts or questions?\n\nAssigning project team roles and responsibilities\nRACI charts help define roles and responsibilities to ensure that work gets done efficiently.\nResponsible - those doing the work to complete the task\nAcountable - those making sure the work gets done\nConsulted - those giving feedback, like subject matter experts or decision makers\nInformed - those just needing to know the final decisions\nYou must write down each task and assign it the appropriate role for each stakeholder, like so:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nindividual-rolestasks andRAdeliverablesCITasks listed in the first column, and roles dispersed in the cells based on level of engagement.Better to use roles rather than names usually, as people may have multiple roles.\n==This is confusing. Reading page right after the video places RACI as the columns and the roles in the fields. This module also does not distinguish “roles” in the contexts of RACI roles and the actual roles within the project, so that’s confusing.\nThere will only be one person designated as “accountable” for any given task. This helps prevent confusion and clearly defines ownership. But one person can be accountable and responsible!\nPotential confusion: How do you handle unbalanced workloads? Who do people seek help from when something doesn’t get done? Who makes the final call on a project? How do you prevent or resolve overlap?\nIt’s important to keep communication clear and concise, and sometimes even limit it, as overcommunication can create overload and overcomplicate things.\nWays to define roles:\nResponsible - doing the work\nWhat department does the work fall under?\nWho performs the work?\nAccountable - helpful to separate from responsible when possible\nWho will delegate the task to be completed?\nWho will review the work to to determine if the task is completed?\nConsulted - communicate frequently with responsible\nWho will the task impact?\nWho will have input or feedback for the responsible person to help the work be completed?\nInformed - possible to have many people assigned this role\nWho cares about this tasks completion?\nWho will be affected buy the outcome?\nCheck how many R’s any individual has to see if the workload is out of balance.\n==If a project is small enough with a small number of stakeholders and fairly defined roles, making a RACI chart may be unnecessary and counterproductive.\nProjects can fall through for a number of reasons…\n\nunclear expectations\nunrealistic expectations\nmiscommunication\nlack of resources\nscope creep\nYou’ll want to clarify each of these areas upfront to avoid pitfalls. *But even if you do fail or fall short of expectations, it is an opportunity to learn and improve!\n\nReference\ncoursera.org"},"index":{"slug":"index","filePath":"index.md","title":"My Site","links":["Coursera/Google-Project-Management-Course/Course-1/Course-1-Module-1---Intro-to-Project-Management"],"tags":[],"content":"2025-06-19 12:35\nCourse 1 Module 1 - Intro to Project Management\nReference"}}