{"Coursera/Google-Project-Management-Course/Course-1---Foundations-of-Project-Management/Module-1---Intro-to-Project-Management":{"slug":"Coursera/Google-Project-Management-Course/Course-1---Foundations-of-Project-Management/Module-1---Intro-to-Project-Management","filePath":"Coursera/Google Project Management Course/Course 1 - Foundations of Project Management/Module 1 - Intro to Project Management.md","title":"Module 1 - Intro to Project Management","links":[],"tags":["project_management","coursera"],"content":"2025-05-08 16:22\nCareer Identity - the unique value that you bring to the workforce, informed by who you are and what you have to offer, now and in the future\nmade up of:\n\nyour strengths - I’m a people person, an effective communicator. I’m cooperative and creative. I’m an intermediate illustrator, amateur musician, and a graphic design graduate, and have a knack for visualizing ideas. I’m detail oriented and love a challenge.\nyour motivations - I love helping people resolve problems and being able to provide assistance and find solutions. I love storytelling and expressive works of art, especially animation and music. I want to make things that are evocative and stylish, while remaining authentic. I’m driven to do my best in whatever I set out to do, and make something I can be proud of each time.\nyour values - I value authenticity, honesty, and integrity. I strive to achieve sustainability and efficiency.\n\nCareer Identity Statement:\nI am an artist and office worker with 3 years experience doing administrative, organizational, and detail oriented work. My greatest strength is interpersonal communication, and I have a talent for helping people understand unfamiliar ideas. I’m passionate about helping others, and I value authenticity and integrity.\nWhat is a “project”?\nIt’s a unique endeavor, with unique deliverables.\nIt’s temporary, with a beginning and an end.\nit involves planning, organizing, budgeting, and communicating.\nIt’s a project manager’s job to make sure the project is both valuable and successful.\nManufacturing, construction, IT, publishing, finance, oil and gas are all industries that are experiencing growth in project manager positions.\nProject Manager &gt; Program Manager &gt; Portfolio Manager\n*Missed milestone is not a failure, but data that needs to be addressed and reevaluated.\nReference\nCoursera.org"},"Coursera/Google-Project-Management-Course/Course-1---Foundations-of-Project-Management/Module-2---Core-Skills":{"slug":"Coursera/Google-Project-Management-Course/Course-1---Foundations-of-Project-Management/Module-2---Core-Skills","filePath":"Coursera/Google Project Management Course/Course 1 - Foundations of Project Management/Module 2 - Core Skills.md","title":"Module 2 - Core Skills","links":[],"tags":["project_management","coursera"],"content":"2025-05-13 11:34\nProject managers add value to their teams! Wow!\nPrioritization: they help their team break down large tasks into smaller steps.\nSometimes I don’t feel like I’m good at this step, but the house painting example sounds like one I would be very good at. I’d consider all the things the lecturer mentioned, because I’m obsessive about making sure anything permanent is done properly.\nDelegation is utilizing people and their strengths for the jobs they are the best fit for.\nCommunication and checking in regularly and staying in contact is key! Keep people informed.\nBased on the lecture, JuAnne’s experience as a project manager sounds like something I would enjoy. Or at least feel good about doing.\nCustomers can be internal and external.\nInternal: stakeholders like management, team members, resource managers, organizational department\nExternal: clients, contractors, suppliers, consumers\nGoals centered around the customer. The team is the project’s greatest asset. Fostering relationships through communication makes people feel valued. Managing the project also involves clearly communicating everyone’s roles and their impact. Manage quality by mitigating risks as they change and new ones come up. Ask for input and suggestions from your team about how to build towards your goal; this will let them use their voice and help foster an environment of accountability and responsibility, and likely make the team feel closer.\nA cross-functional team has a diverse skillset but works towards a shared goal.\nCore Skills\nEnabling Decision-Making: gathering info so that you and your team can make informed decisions, and communicating these decisions to all relevant parties\nCommunicating and Escalating: staying in touch and making sure everyone is working from the same plan, and bringing risks and issues to the attention of stakeholders when appropriate. When escalating, try to approach management with the problem and the solution, or at least suggestions.\nFlexibility: ability to adjust to unforeseen changes in conditions.\n\nAssess external constraints\nPlan for risks and challenges\nCalculate “float” in your schedule\n\nStrong Organizational Skills: Tracking tasks and progress towards the goal, and the needs of the team and the project each step of the way\nInterpersonal Skills:\n\nCommunication\nNegotiation\nConflict Mediation\nUnderstanding motivations\n\nbonus ones: Active listening, Shifting perspectives\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-1---Foundations-of-Project-Management/Module-3---Project-Lifecycle":{"slug":"Coursera/Google-Project-Management-Course/Course-1---Foundations-of-Project-Management/Module-3---Project-Lifecycle","filePath":"Coursera/Google Project Management Course/Course 1 - Foundations of Project Management/Module 3 - Project Lifecycle.md","title":"Module 3 - Project Lifecycle","links":[],"tags":["project_management","coursera"],"content":"2025-05-14 11:47\nProject Lifecycle:\nInitiate the Project\n\ndefine project goals\ndetermine resources, people, and other project details\nget approval from management\n\nMake a Plan\n\ncreate a budget\nset the schedule\nestablish your team, determine roles and responsibilities\nplan for risk and change\n\nExecute and Complete Tasks\n\nmanage progress\ncommunicate (err on the side of over-communication)\nmake adjustments\n\nClose Project\n\ncheck to make sure all tasks have been completed\nconfirm acceptance of the project outcome\nreflect on lessons learned (retrospective)\nshare final results with stakeholders (including all documentation)\ncelebrate!\nformally move on from the project.\n\nProject Management Methodology\n\nLinear! One step at a time. Final result is unlikely to change.\nIterative - different tasks can be in progress simultaneously, end result can change throughout. Allows for flexibility and expects changes\n\nWaterfall\nThis is linear, and is used from construction to product and app design. There are many styles as well.\nThe process for waterfall mirrors that of a project lifecycle.\nIt is utilized when the phases of the project are clearly defined and most tasks must be completed before moving on to the next one. Also when making changes expensive. There are still ways to manage risk though.\n\nchanges go through a formal request process\n\nAgile\nThis is iterative, and movies quickly, with changes made frequently and easily. Usually phases overlap and tasks are completed in iterations.\nGood for when the result is not clearly defined, but the customer has a list of qualities or some idea of what they want it to look like.\nAlso good for when uncertainty and risk are high.\n\nprogress towards milestone is dependent on stakeholder feedback\n\nLean Six Sigma\nThis is a fusion of Lean and Six Sigma, which is utilized when the goals are to save money, improve quality, and move through processes quickly. Also focuses on team collaboration.\nThe five phases for this are:\nDefine - tells you what to measure\nMeasure - tells you what to analyze\nAnalyze - tells you what to improve\nImprove - tells you what to control\nControl - monitoring the project and ensuring quality\nDMAIC be applied to any business problem!\nLean helps limit resources, reduce waste, and streamline processes to maximize benefits. The 5S quality tool:\n\nSort: remove unneeded items\nSet in order - arrange and label items so they are easy to use\nShine - keep the workspace clean and items in their proper place\nStandardize - perform the process the same way each time\nSustain - make a habit of maintaining correct procedures and instill this discipline in your team\n\nIt also uses a Kaban board to help monitor progress, which categorizes tasks into To Do, In Progress, Testing, and Done.\nSix Sigma reduces variations by ensuring quality procedures are followed every time.\n\nFocus on the customer\nIdentify and understand the work itself, and how it gets done\nMake your processes flow smoothly\nReduce waste and concentrate on value\nStop defects by removing variation\nInvolve and collaborate with your team\nApproach improvement and activity in a systematic way.\n\nFor some reason there are seven principles. The seem kind of abstract and arbitrarily arranged.\nScrum is an Agile framework that focuses on developing, delivering, and sustaining complex projects and products with small cross-functional teams lead by a Scrum Master. Short deliverables\nDifferentiating qualities between LeanSixSigma and Scrum seems difficult.\nLSS is more long term, Scrum is shorter development sprints for iterative design\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-1---Foundations-of-Project-Management/Module-4---Organizational-Structure":{"slug":"Coursera/Google-Project-Management-Course/Course-1---Foundations-of-Project-Management/Module-4---Organizational-Structure","filePath":"Coursera/Google Project Management Course/Course 1 - Foundations of Project Management/Module 4 - Organizational Structure.md","title":"Module 4 - Organizational Structure","links":[],"tags":["coursera","project_management"],"content":"2025-06-17 09:48\nOrganizational Structure\nOrganizational structure helps you understand where you fit in, who to communicate with, and how frequently.\nCommonly mapped out using an org chart, showing the relationships of people and groups within the organization, and who reports to who.\nClassic Structure is a typical top-down system of reporting, like a chain of command.\nMatrix Structure has people directly above you, but also people laterally from other departments/programs that need your reports for their work.\nLooks to me like siloed columns vs a table with columns and rows.\nProject Management Office (PMO):\nA group within an organization that sets and defines project management standards and processes in the organization. It often acts as a coordinated center for all of the organization’s projects. They offer guidance and support to the project managers.\nFunctions:\n- Strategic planning and governance\n- Best practices\n- Common project culture\n- Resource management\n- Creation of project documentation archives, and tools\nA PMO’s basic functions are:\n\nStrategic planning and governance\n\nThe most important one; this involves defining project criteria, selecting projects according to the org’s business goals, and then providing a business case for those projects to the management team.\n\n\nBest Practices\n\nprocess guidance, lessons previously learned,\n\n\nCommon project culture\n\nsetting the culture for new employees to work effectively in the organization\n\n\nResource management\n\nproviding training, mentoring, coaching to all employees, especially PMs, and helping define roles and responsibilities while allocating resources\n\n\nCreation of project documentation, archives, and tools\n\nproviding templates, tools, and software to manage projects and maintain the org’s project history\n\n\n\nOrganizational Culture\nA company’s culture is really important! Asking about the company’s culture at an interview is a great way to get more info about the company and shows you understand how big of an impact it can have on a project.\nAsk questions. What’s going well? What do your peers think should change? Make observations, like what people like and respect about the company’s culture. Understand your impact.\nThe Importance of organizational culture\nIdentity\ndescribes the way the company does business, hand in hand with the company’s values. You can think of this as a company’s personality, giving insight into what the company believes and how it will behave.\nPeople\nCulture can help retain a company’s best employees, while attracting great people too. People who feel valued, engaged, and challenged are more likely to perform better and drive for success.\nProcesses\nA company’s culture almost always reflects on the way it works, internally and externally, and in turn the way the company does business inside and outside affects the culture. If a company values feedback, opportunities for clients and employees to comment will be incorporated into the process.\nAs a project manager, understanding the company&#039;s culture helps navigate departmental interactions and communicate more effectively.\n“What are the top 3 challenges you want to solve today?”\nHelp your team determine what success looks like for each week.\nUnderstanding Change Management\nYou completed your project. Yay! Now what?\nHaving others adopt it is the first step to it having an effect on the org’s processes. This is change management!\n**Core Concepts:\n\ncreating a sense of ownership and urgency (getting others to feel like they are empowered to take responsibility for the successful completion of their tasks, and that the project is important and what is required for progress)\nFinding the right combination of skills and personalities\nEffective communication. This is key!\n\nSome good practices:\n\nbe proactive\ncommunicate about upcoming changes\nfollow a consistent process\npractice empathy\nuse tools like feedback mechanisms, flowcharts, and culture maps\n\nGovernance in business is the framework within which decisions are made and accountability and responsibility are determined.\nHow to uncover job opportunities!\nAnalyze job listings: collect a number of job descriptions and rank the frequency of each requirement.\nCreate a professional inventory: a comprehensive list of technical skills, interpersonal skills, personal qualities, and education.\nMatch your profile to the job requirements\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-2---Project-Initiation/Module-1-and-2---Project-Initiation;-Identifying-Project-Goals":{"slug":"Coursera/Google-Project-Management-Course/Course-2---Project-Initiation/Module-1-and-2---Project-Initiation;-Identifying-Project-Goals","filePath":"Coursera/Google Project Management Course/Course 2 - Project Initiation/Module 1 and 2 - Project Initiation; Identifying Project Goals.md","title":"Module 1 and 2 - Project Initiation; Identifying Project Goals","links":[],"tags":["project_management","coursera"],"content":"2025-06-17 09:52\nModule 1: Project Initiation\nIt’s the first step, so it’s important that you set yourself up for success!\nRecap: It’s a project managers responsibility to identify the project’s goals, resources, and other details, based on discussion with the project stakeholders.\nInitiation is an opportunity to gain clarity on expectations, which will save a lot of time for everyone throughout the project.\nConsiderations for Cost Benefit Analysis:\n\nvalue created\nreduced costs\nincreased profit\ntime saved\nimproved user experienced\nBalance these with…\ntime investment\none-time costs\nongoing costs\nlong-term costs\n\nAlso considerable are intangible benefits!\n\ncustomer satisfaction\nemployee satisfaction\nemployee productivity\nbrand perception\n…As well as intangible costs, like employee retention, or any of the above benefits.\n\nI&#039;m very glad these are mentioned. Sometimes the intangible is difficult to describe, but can be very important.\nKey components of project initiation:\n\nGoals - what you’ve been asked to do and what you’re trying to achieve\nScope - defining the work that needs to get done to complete the project\nDeliverables - products and services that you will create for the client\nSuccess Criteria - the standards by which you measure how successful a project was\nStakeholders - the people who have an interest in and are affected by the completion and success of the project\nResources - budget, people, and materials you have at your disposal\nInteresting that they ordered these this way, with resources on the bottom...\n\nA project charter is a framework for you to organize and clarify all these details and communicate them to others.\nIt’s important to build you “listening to learn” muscle.\n(G-C) / C = ROI\nROI is interesting. At first it seems strange, but then it makes sense.\nModule 2 - Identifying project goals\nRACI chart?\nSMART goals:\nSpecific\nWhat do I want to accomplish? Why is this a goal? Who is involved? Where should it be delivered? To what degree?\nMeasurable\nHow much/how many? How can you know it is accomplished?\nAttainable\nCan it be reasonably reached? How can it be accomplished?\nRelevant\nDoes this goal make sense? Is it worthwhile? Is it the right time?\nTime-bound\nHas a deadline or a clear timeframe\nObjectives and Key Results: combining a goal and a metric to determine a measurable outcome.\nCompany level OKRs are shared across an organization so that everyone can align and focus to help the company reach its goals.\nProject level OKRs help define measurable project goals, and need to align with both company and department level OKRs.\nProject Scope: the boundaries of a project\nScope-defining questions should be posed in these contexts:\n\nStakeholders\nGoals\nDeliverables\nResources\nBudget\nSchedule\nFlexibility\nMake sure to define who, what, when, why, and how.\n\nOut-of-scope: tasks that are not included in the project plan and don’t contribute to the goal\nScope-creep: changes/growth/uncontrolled factors that affect a project’s scope at any point after the project begins\nTo help avoid scope-creep,\n\nmake project plans visible\nget clarity on project requirements\nset ground rules and expectations for stakeholder involvement\ncreate a plan for dealing with out-of-scope requests\nput your agreements and plans in writing\n\nImportant:\nAny change outside of a project scope comes off the bottom line, and it is your job as a project manager to maintain the boundaries of the project. The best defense is to know all of the project’s ins and outs.\nBest practices to help control scope creep:\n\nDefine project requirements\nSet a clear project schedule\nDetermine what is out of scope\nProvide alternatives\nSet up a change control process\nLearn how to say no\nCollect costs of out-of-scope work\nThese points are very sequential!\n\nThere is a balance between scope, time, and costs, in the shape of a triangle. Kind of like balancing time, cost, and quality. Or like geometry! Changing one area will have a direct effect on one or more of the others. There is always a tradeoff.\nDocument everything beforehand and make sure everyone (team and stakeholders) is in agreement on the scope before the start of the project.\nLaunching and Landing\nproperly delivering the project and tracking the results after the product has been in use\nDon’t launch and forget! It is relieving to hand your project over to the client and celebrate completion, but ensuring the project’s success means you need to see if it meets the success criteria you laid out beforehand, or is on track to meet them.\nBaking a cake isn&#039;t enough to tell whether you did a good job- someone has to taste it and confirm.\nTo determine a project’s success criteria…\n\nIdentify measurable aspects of your project\nGet clarity from stakeholders on project requirements and expectations (key!)\nDocument and share all the info so that the team and stakeholders can refer to it later.\n\nThe metric(s) you choose must be as closely aligned to the project goal as possible. Satisfaction, adoption, and engagement are some ways of measuring success.\nIt&#039;s smart to measure success while the project/product is in progress. This can be done by having your team complete checklists for progress meetings, or hold live feedback sessions with users/customers.\nMethods for measuring criteria for success should include how, when (how often), and who. Defining success criteria should create greater alignment in the team and give everyone better visibility of how to achieve success. Remember SMART goals!\nReference\ncoursera.org, my brain"},"Coursera/Google-Project-Management-Course/Course-2---Project-Initiation/Module-3---Working-Effectively-with-Stakeholders":{"slug":"Coursera/Google-Project-Management-Course/Course-2---Project-Initiation/Module-3---Working-Effectively-with-Stakeholders","filePath":"Coursera/Google Project Management Course/Course 2 - Project Initiation/Module 3 - Working Effectively with Stakeholders.md","title":"Module 3 - Working Effectively with Stakeholders","links":[],"tags":["project_management","coursera"],"content":"2025-06-18 16:23\nExploring project team roles and responsibilities\nAccessibility, for project managers\nOver one billion people have a disability, and many disabilities are not immediately visible.\nWhen you create solutions for persons with disabilities, you are not only serving the critical audience of people with permanent disabilities, you are also unlocking secondary benefits for everyone who may move in and out of disability over time.\nExamples of accessibility we don’t immediately think about:\n\nmobile voice assistant\nspeech to text\nclosed captions\n…And ones that have become commonplace!\nremote control\ntypewriter/keyboard\noffice scanner\nSMS text messages\nelevator\n\nThe fact that they included this makes me happy and hopeful.\nChoosing the right team\nConsider…\n\nRequired roles\nTeam size\nNecessary skills - these can be taught, but make sure it is done in a timely fashion!\nAvailability\nMotivation - surprising, but important!\n\nFixed Roles:\n\nProject sponsor\nTeam member\nUser\nStakeholder\nProject manager - you!\n\nA project sponsor initiates the project and is responsible for presenting a business case for its existence and releasing resources to the project manager.\nThey advocate for alignment with senior management, advise on key business decisions, and approve budget and resources.\nBasically the project director!\nIt’s important to understand people in context.\n“The most important part of program management is understanding the personalities of the people you work with so that you can tailor your approach to make sure you’re working effectively with them.”\nThis is why it’s important to have a flexible approach!\nEvaluating Stakeholders\nStakeholders range from active to passive depending on the project, and steering committees may not be necessary for all of them.\nCompleting a Stakeholder Analysis:\n\nMake a list of all the stakeholders that the project impacts\nDetermine the level of interest and influence for each stakeholder\nAssess stakeholders’ ability to participate and then find ways to involve them\n==Interest refers to how much the stakeholder’s needs are affected by the project operations and outcomes\n\nThe important of a stakeholder depends on how high their interest and influence is. Those with the highest are called key stakeholders, without whose help the project would be unlikely to successfully land.\nA “power grid” can help plan how to best manage stakeholders.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n^^^21influence43interest&gt;&gt;&gt;\n\nKey stakeholders; collaborate with them closely.\nHigh influence, low interest; meet their needs. (i.e. Director of Product)\nHigh interest, low influence; show consideration for them. (i.e. customer success team)\nLow influence, low interest; they still matter! They’re just less integral to the daily process. You just want to monitor them.\n\nThe key stakeholders with the most influence and interest typically have the power to change the budget and approve updates to the timeline or scope. They are Big Boss.\nWhile they aren’t part of the steering committee, the PM is responsible for gathering and providing all the necessary information for decisions to be made quickly.\nStakeholder buy-in\nThe process of involving stakeholders in the project’s decision making with the goal of reaching a broader consensus on the organization’s future.\nThis requires different styles of engagement and involvement depending on the person and situation, so choose accordingly.\nTips for gaining buy-in:\n\nClearly mapping out the work of the project to the goals of the stakeholder\nDescribing how the project aligns with their goals\nListening to feedback and finding ways to incorporate it into the project’s charter where appropriate\nSuggested questions for stakeholders:\nWhat are your top priorities/goals?\nHow will this initiative/project support you and your goals?\nWhat role would you like to play in this project?\nHere’s how I plan to keep people informed… Does that work for you?\nWhat can I clarify?\nWhat are your expectations? What would you like this project to accomplish?\nWhat does success look like for you?\nAnyone else you would recommend I reach out to about this initiative?\nWhat info or insights do you have that might be challenging for me to find?\nWhere do you see me getting support or running into resistance?\nAny additional thoughts or questions?\n\nAssigning project team roles and responsibilities\nRACI charts help define roles and responsibilities to ensure that work gets done efficiently.\nResponsible - those doing the work to complete the task\nAcountable - those making sure the work gets done\nConsulted - those giving feedback, like subject matter experts or decision makers\nInformed - those just needing to know the final decisions\nYou must write down each task and assign it the appropriate role for each stakeholder, like so:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nindividual--rolestasks andRAdeliverablesCITasks listed in the first column, and roles dispersed in the cells based on level of engagement.Better to use roles rather than names usually, as people may have multiple roles.\n==This is confusing. Reading page right after the video places RACI as the columns and the roles in the fields. This module also does not distinguish “roles” in the contexts of RACI roles and the actual roles within the project, so that’s confusing.\nThere will only be one person designated as “accountable” for any given task. This helps prevent confusion and clearly defines ownership. But one person can be accountable and responsible!\nPotential confusion: How do you handle unbalanced workloads? Who do people seek help from when something doesn’t get done? Who makes the final call on a project? How do you prevent or resolve overlap?\nIt’s important to keep communication clear and concise, and sometimes even limit it, as overcommunication can create overload and overcomplicate things.\nWays to define roles:\nResponsible - doing the work\nWhat department does the work fall under?\nWho performs the work?\nAccountable - helpful to separate from responsible when possible\nWho will delegate the task to be completed?\nWho will review the work to to determine if the task is completed?\nConsulted - communicate frequently with responsible\nWho will the task impact?\nWho will have input or feedback for the responsible person to help the work be completed?\nInformed - possible to have many people assigned this role\nWho cares about this tasks completion?\nWho will be affected buy the outcome?\nCheck how many R’s any individual has to see if the workload is out of balance.\n==If a project is small enough with a small number of stakeholders and fairly defined roles, making a RACI chart may be unnecessary and counterproductive.\nProjects can fall through for a number of reasons…\n\nunclear expectations\nunrealistic expectations\nmiscommunication\nlack of resources\nscope creep\nYou’ll want to clarify each of these areas upfront to avoid pitfalls. *But even if you do fail or fall short of expectations, it is an opportunity to learn and improve!\n\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-2---Project-Initiation/Module-4---Essential-Project-Resources":{"slug":"Coursera/Google-Project-Management-Course/Course-2---Project-Initiation/Module-4---Essential-Project-Resources","filePath":"Coursera/Google Project Management Course/Course 2 - Project Initiation/Module 4 - Essential Project Resources.md","title":"Module 4 - Essential Project Resources","links":[],"tags":["project_management","coursera"],"content":"Understanding project resource needs\nRefresher… Typical resources are:\n\nBudget\nPeople\nMaterials\n\nIt’s important to figure out the project’s resources before it gets started! It’s essential for planning and making sure your team members have what they need to get their work done, which is one of the main duties of project management.\nBudget (estimate of how much money is needed)\nHidden costs, like taxes?\nPeople (who help execute the tasks of the project)\nYou, the project manager, are a resource!\nIncludes people outside the company who have certain skills or can complete some tasks your team does not/cannot.\nMaterials\nItems and… materials. Includes non-physical things like programs/applications.\nThese resources are interdependent.\nDeveloping documentation for project kickoff\nAs demonstrated thus far, a major part of project management is guiding decision making.\nDocumentation helps keep everyone on the same page and enables them to focus on their tasks instead of the litany of details about the project. Also helpful for team members that get added on midway through! Also helps you reflect and learn from your experiences.\nProject proposal\nDocument persuading a stakeholder to begin a project, showing that the benefits of the project outweigh the costs. (Cost benefit analysis)\n- Value created\n- Money saved\n- Time invested\nMay not be the project manager’s responsibility!\nTypically only necessary at the start of a project.\nIt’s important to make sure you and your stakeholders agree on the project value!\nProject charter\nFormal document clearly defining the project and outlining the details necessary to reach its goals.\nApproval is important for making sure a project matches the needs of an organization.\nUsed throughout all stages of a project, and can evolve as the project progresses.\nCan be tailored to specific audiences and/or stakeholders.\nCommon criteria in project charters:\n\nintro/project summary\ngoals/objectives\nbusiness cases/benefits and costs\nproject team\nscope\nsuccess criteria\nmajor requirements, key deliverables, OKRs\nbudget\nschedule/timeline or milestones\nconstraints and assumptions\nrisks\napprovals\n\nFor more complex projects, you may include links to additional analysis, studies, or documents.\nThe more detailed the project charter is, the easier it will be to convert it into an effective project plan.\nEvaluating tools to meet project needs\nProject management tools help you track deadlines, provides visibility to others, manage a budget, create helpful diagrams, manage contracts…\nThe complexity of the tool should be appropriate for the size and scope of the project.\nMake sure beforehand that implementing a new tool is worthwhile. Show the benefits as clearly as you can. By demonstrating your understanding of the tool and your competency with it, you will help build trust and make your team more comfortable with the change.\nImportant things to consider:\n\ndiscuss the tool early and often, if possible. Don’t blindside your team!\nAsk for feedback from stakeholders; they may have some expertise.\nInvolve key stakeholders in demonstrations as you get closer to making the final decision on the tool.\nEnsure the tool is fully functional before introducing it.\nSet up training for the tool as needed before asking your team to use it.\n\nA lot of the tools listed sound like they serve very similar purposes, but I’m sure they each have their own nuances that make them more appropriate for certain projects over others. Pretty unclear from an introductory view though.\n2025-06-27 13:45\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-3---Project-Planning/Module-1---Kicking-Off-the-Planning-Phase":{"slug":"Coursera/Google-Project-Management-Course/Course-3---Project-Planning/Module-1---Kicking-Off-the-Planning-Phase","filePath":"Coursera/Google Project Management Course/Course 3 - Project Planning/Module 1 - Kicking Off the Planning Phase.md","title":"Module 1 - Kicking Off the Planning Phase","links":[],"tags":["coursera","project_management"],"content":"2025-07-02 14:17\nThis module covers:\n\nKicking off the planning phase\nSetting and reaching milestones and identifying tasks to do so\nBudgeting process\nIdentifying and planning for risks\nDocumentation\n\nReview: Project Initiation\nProject manager is assigned,\nProject goals, scope, and deliverables must be approved\nTeam members get assigned\nGet signoff on your project charter\nUnderstanding the planning phase\nPlanning helps…\n\nUnderstand the work needed to achieve your goal\nCoordinate efforts and timelines with other teams, contractors, and vendors\nIdentify and prepare for risks\nGet buy-in from key members of the project team\n\nThe three main parts of the planning phase are the schedule, budget, and risk management.\nThe project kickoff meeting should include the team members, stakeholders, and sponsor. This will help you team by\n\nestablishing a shared vision\naligning on scope\nbuilding team rapport\ngiving them the opportunity to ask questions and offer insights\nsetting expectations\n\nThese meetings are typically structured like this:\n\nIntroduction of people and their roles\nBackground on the project (how it came about, why it matters)\nGoals and scope\nExplaining the individual roles\nCollaboration (what tools used and expectations there will be)\nWhat comes next- setting expectations\nQuestions and feedback! Gain clarity and make sure the project is benefiting from diversity of thoughts and experiences.\n\nDon’t ambush your team members- send them an agenda for the meeting a day or two ahead of time. And make sure to ask someone to take notes!\n==The quiz says the planning phase “helps team members become a strong team by working together.” I thought this was wrong because there is little or no work for them to do in the planning phase, but it seems they meant that planning helps clarify a mutual understanding of the project and establish rapport. That could have been worded differently to be less confusing.\nDefining tasks and milestones\nMilestones are reached by completing certain tasks. (much wow)\nSetting milestones is important! It helps by\n\ngiving you a clear understanding of the amount of work required. Manageable chunks\nkeeping your project on track with clear deadlines\nuncovering areas where you may need to adjust scope, timelines or resources\nmotivating your team as you make progress. This one’s extra important!\nalso showing progress to your stakeholders\nMilestones must be completed sequentially and on time! Because they’re sequential, missed deadlines will cause delays and expand the timeline and or budget.\n\nRefer back to your project charter, and think about what your team needs to do to achieve the goal. The big items that indicate progress are your milestones. Smaller items that your stakeholders wouldn’t want to review are tasks.\nTop-down scheduling: first outlining milestones and then defining the tasks that will be required to reach them\nBottom-up scheduling: looking at all the individual tasks required to reach the goal and grouping them into manageable chunks as milestones\nDon’t set too many milestones- the number needed will depend on the project.\nDon’t mistake tasks for milestones; milestones represent moments in time, like mini-goals.\nDon’t list tasks and milestones separately. They are interdependent and should be visualized together.\nWork Breakdown Structure (WBS)\na tool that sorts the milestones and tasks in a hierarchy of importance by the order in which they need to be completed\n(note: not typically included in the official project plan)\nCreating a Work Breakdown Structure:\n\nDefine scope and objectives\nBreak down into key phases and deliverables\nOrganize deliverables into work packages (defining the work, duration, and cost for tasks, as well as owners)\n\nAsana is very good for assigning tasks. Assigning tasks helps create a sense of personal responsibility and ownership for the team. This helps keep them motivated and invested! (Also helps build trust and rapport)\nStarting the Planning phase\n\nGantt chart? Sounds like a schedule. Helps outline and clarify task timelines and dependencies.\nEstimate the budget, and include a buffer for overages. They are always overages.\nCreate a Statement of Work (SoW) for any vendors and yourself\na legal document that defines what you need from the vendor and sets clear expectations.\nCreate a risk management plan, anticipating sick days, staffing shortages, shipping delays, etc.\nCreate a communication plan to track senders and recipients, communication goals, key dates, and more. It’s important for information to travel timely and smoothly, so plan this beforehand!\n\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-3---Project-Planning/Module-2---Building-a-Project-Plan":{"slug":"Coursera/Google-Project-Management-Course/Course-3---Project-Planning/Module-2---Building-a-Project-Plan","filePath":"Coursera/Google Project Management Course/Course 3 - Project Planning/Module 2 - Building a Project Plan.md","title":"Module 2 - Building a Project Plan","links":[],"tags":["project_management","coursera"],"content":"2025-07-15 18:43\nGetting started with a project plan\nMost project plans are made up of five elements:\n\nTasks\nMilestones\nPeople\nDocumentation\nTime\n\nScope and goals - Work Breakdown Structure - Management plans - Budget\nThese are connected!\nUsing estimation to set project timelines\n(Management plans are plans on how to handle communication, risk, and any changes that will arise, anything that helps keep the project on track.)\nEffort vs. time estimation: Painting a wall takes 3 hours of work (effort) and 24 hours to dry (time)\nThis is useful for planning multitasking/parallel tasks.\nYour teammates will have the most realistic estimates of how long their tasks will take. Who knew!\nTime buffers are nice, but should be used sparingly for tasks within the teams control. It may be easier to set a project buffer at the end of the project instead of many smaller task buffers along the way.\nDon’t get caught up in the optimism fallacy; Murphy’s Law may be a bit extreme, but something is guaranteed to go differently than your plan. Expect the unexpected.\nCapacity planning refers to the allocation of people’s time and energy, and other resources to project tasks.\n(Earlier people counted as resources, but the mini quiz separates them two different things)\nCapacity planning involves these areas of focus:\n\nIdentifying parallel tasks vs. sequential tasks and maximizing your team’s use of time. Sequential tasks help you see what you need to prioritize.\nDetermine which tasks have a fixed start date\nDetermine earliest start dates for all other tasks\nIdentify if a task has float (or slack)\nThe amount of time you can wait to begin a task before it impacts the project schedule and threatens the outcome\nTasks on the critical path will have no float.\n\nDeciding how a teammate should prioritize their time and make the most of their capacity can be done by determining the critical path:\nA list of project milestones and their mandatory tasks required to meet the project goal on schedule. It is the bare minimum number of tasks and milestones needed to reach your goal.\nTo determine the your critical path,\n\nCapture all tasks\nSet dependencies\nCreate a network diagram, sequencing tasks based on dependencies and parallels. Non-essential tasks are not part of the critical path.\nMake time estimates for essential and non-essential tasks using capacity planning. Essential tasks will have zero float, while non-essential ones will have some float.\nThe essential tasks and their required time will be your critical path!\n\nYou can also calculate the critical path two ways:\n\nForward pass - adding the duration of each task on the critical path from start to finish. Good for simplicity. Potential for expansion?\nBackwards pass - start at the end goal and work backwards through the required tasks. Helps with hard deadlines by focusing on which tasks are really critical. Some tasks may be completed later or cut altogether.\n\nSoft skills are personal characteristics that help you work effectively with others. They will be helpful for gathering accurate estimates from your teammates.\nSome common ones to apply:\n\nAsking the right questions - open ended and follow ups!\nNegotiating effectively - ask probing questions and follow ups to get a feel for their flexibility and workload\nPracticing empathy - ask about their workload, inside and outside the project, as well as any other things that may demand their time and focus, including rest and time off.\n\nAngel sounds like a great project manager :)\nUtilizing tools to build a project plan\nThe anchor of a clear project plan is a clear schedule, containing all tasks, their owners, and their deadlines.\nGantt chart - a horizontal bar chart that maps a project schedule.\nCommon left columns: task title, task owner, start date, due date, duration, % completed. The rows below will list each task. Great place to plug in your work breakdown structure.\nRight columns will be for days and weeks estimated to complete the project from start to finish. The rows below this will show bars/markers showing dates when each task will take place.\nMay not work for all projects!\nKanban board - uses cards to track and visualize the progress of your tasks, typically moving tasks between columns like “to do,” “in progress,” “testing,” and “done.” This tool is useful for an Agile project approach.\nrefresher - Agile is an iterative development process where results are tested along the way, incorporating customer feedback.\nKanban boards help by\n- giving a quick visual understanding of work details and critical task info\n- facilitating hand-offs between stakeholders and team members\n- capturing metrics and improving workflows\nCards have:\n- titles/ID numbers for one task\n- who is assigned to the task\n- description of work\n- estimation of effort\n- start date, finish date\n- blocked days where it cannot be worked on\nAsana and Trello both have good Kanban plugins.\nOr you could just have a large document containing tables, lists, and links to other planning documents. It’s up to you to decide how to keep everyone on the same page as long as you include all of the critical project elements in one place.\nTask names (or ID numbers if there are a lot) to make communication clear\nTask durations to get clear time estimates and schedule\nStart and finish dates on tasks to measure progress\nWho is responsible for each task\nBest practices for project planning:\n\nCarefully review deliverables, milestones, and tasks\nGive yourself time to plan\nRecognize and plan for the inevitable; things will go wrong, but it’s okay!\nStay curious - ask your teammates lots of questions about their work\nChampion your plan\nCan your teammates use the tool you used to build the plan?\nIs the information clear enough for your stakeholders?\nWill using this plan as a singular source of truth save your team and stakeholders time and energy when they need to find information on the project?\nIf the answer to each of these is “yes,” then stand by your plan and advocate for its benefits.\n\nReference\ncoursera.org, the ol’ noggin"},"Coursera/Google-Project-Management-Course/Course-3---Project-Planning/Module-3---Managing-Budgeting-and-Procurement":{"slug":"Coursera/Google-Project-Management-Course/Course-3---Project-Planning/Module-3---Managing-Budgeting-and-Procurement","filePath":"Coursera/Google Project Management Course/Course 3 - Project Planning/Module 3 - Managing Budgeting and Procurement.md","title":"Module 3 - Managing Budgeting and Procurement","links":[],"tags":["coursera","project_management"],"content":"2025-07-21 11:15\nComplex ways to track budgets! Myriad of approvals! Legal teams! Lots of acronyms! There’s a lot in this module.\nUnderstanding budgets\nBudgets are broken down by milestones. A Forecast is a cost estimate for a period of time.\nThe budget is actually created during the initiation phase of the project, but is generally adjusted as needed throughout the lifecycle of the project. The budgeting process itself usually happens in conjunction with the scheduling process.\nMost companies have a signing or spending policy, which outlines who is authorized to commit resources or incur costs on behalf of the company. After the project manager collaborates with the team to get estimations for the budget, the sponsor or another shareholder typically review and approve the estimated costs.\nWhen creating a budget, the project manager must account for\n\nUnderstanding stakeholder needs\nBudgeting for surprise expenses (contingency budget)\nMaintaining adaptability\nReviewing and reforecasting throughout the project\n\nTo put together a budget estimate, you must calculate\n\nResource cost rates\nReserve analysis\na method to check for remaining project resources\nContingency budget\na budget for potential risks\nCost of quality\nCosts that are incurred to prevent issues with product, processes, and tasks. This includes\n\nPrevention costs\nAppraisal costs\nInternal failure costs\nExternal failure costs\n\n\n\nBudget planning best practices:\n\nReference historical data - research how budgets for similar projects went.\nUtilize your team, mentors, or manager - get into the habit of asking your team to doublecheck your work, particularly for areas where they have expertise\nTime-phase your budget - track and compare planned vs. actual costs over certain timespans and manage changes to the budget as necessary\nCheck and double-check for consistency and clarity - other departments will be approving and using your budget, so making sure it is error-free and easy to follow is important\n\nDirect costs are for specific items necessary to complete the project. They include:\n\nWages\nMaterials\nEquipment rental\nSoftware licensing\nProject-related transportation\nStaff training\n\nIndirect costs are for items that do not directly lead directly to the completion of the project but are essential for the ream to do their work. These include:\n\nAdministrative costs\nUtilities\nInsurance\nGeneral office equipment\nSecurity\n\nManaging a project budget\nSteps for creating a budget:\n\nGet historical data\nFind out what past project managers did right and wrong\nLeveraging experts\nGetting advice and input from experts in the field, or anyone who has experience in what you are doing\nBottom up approach\nLaying out all the parts of the project from start to finish and listing everything you will need\nConfirm accuracy\nConsult with your team about estimates and double-check everything\nBaseline\nUsing all this, set a dollar amount as a baseline for each section of the project to track progress and success. Adjustments almost always will need to be made!\n\nMake sure to factor in fixed costs, buffers and reserves. This is standard practice. Setting planned cost vs. actual cost helps you monitor the cost every step of the way and avoid exhausting your reserves.\nMonitoring the budget is crucial for a project manager to enforce accountability in terms of spending. Milestones are a great opportunity to review the budget again and identify anything that needs to be reset or revisited throughout the project.\nCost control is proactive budget management, where the project manager identifies factors that might impact the budget and then creates effective actions to minimize variances from the baseline.\nTo control costs,\n\nEstablish a sign off plan and inform appropriate stakeholders of any changes that occur\nManage changes as they’re made\nAccept that budget misses will happen, and determine with sponsors and stakeholders what the acceptable limit is for overage\n\nGoing under budget is a problem too! It’s an indicator of less than satisfactory budget management, and that more money could have been spent on extra resources or better quality output. It may adversely affect the budget of future projects as well.\nCAPEX - capital expenses, long term, benefits the company’s future\nOPEX - operational expenses, short term and often recurring\nWhile contingency reserves cover potential risks, they are risks that are foreseen. Management reserves are for covering unidentified risks.\nContingency reserves are usually an estimated amount, while management reserves are usually a percentage of the total budget.\nFixed contracts usually pay out when milestones are reached. Time &amp; materials contracts are a regular payment schedule.\nIntroduction to procurement\nVendors are typically used for specialized skills which aren’t available within your company. Vendor management entails:\n\nSourcing vendors\nGetting quotes for vendor’s work\nDeciphering which ones will fulfill your needs\nNegotiating vendor contracts\nSetting deadlines for vendors\nEvaluating performance\nEnsuring vendors are paid\n\nThe procurement process:\n\nInitiating - defining what help you need outside of your current resources\nSelecting - determining what supplies you need and which vendors to use\nContract writing - from contract development, review, and getting signed\nControl - maintaining quality and ensuring service agreement is being met\nCompleting - measuring the success of the procurement\n\nProcurement can differ depending on the methodology.\nTraditional procurement management:\n\nFocus on standard contracts with clear terms and deliverables\nProject manager may be responsible for end-to-end procurement\nContracts may feature lengthy and extensive documentation\n\nAgile procurement management:\n\nCollaborative with both project team and end supplier\nEmphasis on the relationship between parties\nProject team plays a larger role in identifying procurement needs\nLiving contract\n\nNon-disclosure agreement (NDA)\nI know this one already.\nRequest for proposal (RFP)\nA document outlining the details of a project for the vendor, so that they can get back to you with a proposal on how they will handle the job\nMake sure it has headers for overview, goals, scope of work, milestones,  submission requirements, and questions you want the vendor to answer\nNDA and RFP are fixed and do not change throughout the project. Statement of Work (SoW) changes as the project goes on.\nStatement of work is usually created by the project manager, but they consult subject matter experts (SME). Legal advisors will review the document as well, and in some cases take part in crafting it alongside the project manager.\nIn addition to relevant project details like deliverables and scope, this document also contains a history of revisions.\nNavigating procurement challenges\nAs the project manager, you will be responsible for making sure procurement is ethical and abides by state and county business laws. Consult with others- if something feels wrong, it’s probably a sign. Check with your company’s legal experts!\nCommon ethical traps:\n\nCorruption and bribery: self-explanatory\nSole-supplier sourcing: anti-competitive\nInteractions with state-owned agencies: they often have much stricter regulations\n\nTo avoid these…\n\nUnderstand the legal requirements of your procurements\nStick to your ethical codes\nTest your ethics.\n\nShame: Would you be ashamed if someone knew what you did?\nCommunity: Would you want your friends to know about the decision you made?\nLegal: Would you face legal action if you did this?\nSituation: Would your actions be justified in this situation?\nConsequence: Would a negative outcome be worth your action?\n\n\n\nReference"},"Coursera/Google-Project-Management-Course/Course-3---Project-Planning/Module-4---Managing-Risks-Effectively":{"slug":"Coursera/Google-Project-Management-Course/Course-3---Project-Planning/Module-4---Managing-Risks-Effectively","filePath":"Coursera/Google Project Management Course/Course 3 - Project Planning/Module 4 - Managing Risks Effectively.md","title":"Module 4 - Managing Risks Effectively","links":["/"],"tags":["coursera","project_management"],"content":"2025-07-26 18:50\nFlexibility is an important skill for managing projects!\nUnderstanding risk management\nA risk is a potential event. If it actually manifests, it becomes an issue.\nRisk management is the process of identifying and evaluating risks and issues in a project, and handling them accordingly.\nIn addition to telling you what could go wrong, risk management also includes who you’ll need to consult with and how the risk could be mitigated. Doing so helps you find ways to change course and alter your project plan so that you can complete it even when issues arise, expected or unexpected.\nIdentify the risk, analyze it, evaluate, treat it, then monitor and control.\nA secondary part of risk management is recognizing and seizing opportunities. Cancelations can mean extra time or other resources become available. Use the same process for managing risk to plan for and make the best use of opportunities.\nSometimes these opportunities are referred to as positive risks.\nIdentifying and assessing risks\nBring your team together to brainstorm risks (reference the RACI chart for participants).\n(It should go without saying, but make sure that brainstorming is a judgement free zone.)\nYou can also structure it with a cause-and-effect diagram, or fishbone diagram/Ishikawa diagram. Consider a risk, or an effect, and work backwards to determine potential causes of that risk.\nRisk assessment generally focuses on determining the likelihood of the risk and its potential effects on the project. Prioritize risks with a probability-impact matrix, where you measure probability against impact on a grid. This is a way of measuring risk exposure.\nBudget risk\nRisk of the budget increasing, either through poor planning or increase in scope\nScope risk\nThe possibility that the project won’t produce the results outline in the project goal\nExternal risk\nRisks from factors outside the company that you have little or no control over\nThere are endless more kinds of risks, and there will never be a prescription for all possible risks. But it’s okay- planning ahead helps you be better prepared!\nSinge point of failure\nA risk that has the potential to be catastrophic and halt work across a project\nDependencies are also large sources of risks, since tasks depend on others before they can be started or completed.\nDependencies come in all variations of start-to-finish. In addition to planning out the schedule, dependency graphs are also helpful in identifying risk.\nMitigating and communicating risks\nThe four types of risk mitigation are:\n\nAvoid the risk altogether by going with a different option\nMinimize the effects or likelihood of the risk\nTransfer the risk to another party or entity (like outside the tea,/company)\nAccept - this usually means setting aside extra funds just in case.\n\nIn your risk management plan, you will include a section detailing the risks and their mitigation plans. The probability and impact matrix will be located at the bottom of the document in the appendix.\nFailing to communicate risks to stakeholders can erode the trust in you as the leader of the project. The severity of the risk will dictate how you go about sharing and discussing them.\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-3---Project-Planning/Module-5---Organizing-Communication-and-Documentation":{"slug":"Coursera/Google-Project-Management-Course/Course-3---Project-Planning/Module-5---Organizing-Communication-and-Documentation","filePath":"Coursera/Google Project Management Course/Course 3 - Project Planning/Module 5 - Organizing Communication and Documentation.md","title":"Module 5 - Organizing Communication and Documentation","links":[],"tags":["coursera","project_management"],"content":"2025-08-01 09:52\nCommunication is a two-way street, and needs to happen throughout the entire lifecycle of the project (fairly obvious).\nEffective communication is clear, honest, relevant, and frequent. But not too frequent. Some tips for being more effective:\n\nRecognize and understand individual differences: be mindful and don’t make assumptions!\nBrainstorm and craft the appropriate message: Consider who your audience is, what they should know and what you need (or don’t need) from them. The focus is clarity.\nDeliver your message: Decide which method is most appropriate, and avoid including any sensitive or private information. Assume everyone at the company will receive the communication.\nObtain feedback and incorporate it: Check to make sure the message was clear and ask for feedback. Respond to questions timely and encourage open communication.\n\nBecause there will be so much communication for any project you do, you will need a communication plan that organizes and documents the process, methods, and expectations of communication for the project.\nThe communication plan needs to address the what, who, when, why, and how of communication, and where it will be recorded and stored.\nIt kind of seems like a lot for just communication, but planning this out helps make it easier to keep people engaged and motivated, gets stakeholders more involved in effective conversations, and improves the communication overall.\nContinuity refers to planning for the project to be able to carry on in your absence, should it happen. Also a good reason to document everything.\nCheck in with your team and evaluate where you may be over- or under-sharing information.\nOnly share info on a need-to-know basis. Some info will be sensitive, and it’s up to you to manage who sees what.\nIt’s good to be comprehensive, but avoid death by a thousand documents!\n\nKey stakeholders\nBarriers\nCommunication methods\nGoals\n\nReference"},"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-1---Introduction-to-Project-Execution":{"slug":"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-1---Introduction-to-Project-Execution","filePath":"Coursera/Google Project Management Course/Course 4 - Project Execution/Module 1 - Introduction to Project Execution.md","title":"Module 1 - Introduction to Project Execution","links":["Risk-exposure"],"tags":["coursera","project_management"],"content":"2025-08-03 11:39\nPreviously we covered planning for\n\nHow to actually respond to risks\nHow to measure and track a project’s progress\nHow to use continuous improvement and quality management techniques\nHow to use and analyze data to inform your own decision-making\nTeam management and the fundamentals of influencing\nEffectively leading your team to the finish line\nTools for effective team communication\nOrganizing and facilitating meetings\nClosing a project\n\nProject execution entails carrying these out, monitoring their progress, and seeing them through to the end.\nTracking and measuring progress\nAside from obviously making sure the project is on track for completion and success, tracking is also important for transparency and risk management.\nCommon things to track:\n\nSchedule\nStatus of action items, key tasks and activities\nProgress towards milestones\nCosts\nKey decisions, changes, dependencies, and risks to the project\n\nThe Gantt chart, measuring tasks against time over the course of the project, is useful for:\n\nVisualizing the project timeline and helping the team stay on schedule\nProjects with many items like dependencies, milestones, tasks or activities\nLarger project teams with many people to manage\nThe visual similarity of a Gantt chart to a waterfall is another reason why the waterfall methodology is named so. ;)\n\nUsing a formal Roadmap is useful for:\n\nHigh-level tracking of large milestones\nIllustrating how a project should evolve over time to the team and key stakeholders\nThe roadmap outlines the project goals and the steps that will be taken to achieve them. It also has a high-level overview, which concisely states the objectives and priorities for your project. This is followed by a table that maps out the process in greater detail, listing milestones across timeframes like quarters or phases.\n\nA Burndown chart measures time against the amount of work done and amount of work remaining. (Like a fuse to an explosive!) This is useful for:\n\nProjects that require a granular break-down of the tasks\nProjects where finishing on time is the top priority\nThis gets mapped to a graph to form a negative slope: x = remaining time, y = remaining work. There is typically a dotted line representing the team’s expected progress and a solid line representing the actual progress.\n\nIn summary…\n\nGantt chart handles a mass of tasks and multiple dependencies\nRoadmaps communicate milestones to large teams, best for getting a big-picture view\nBurndown chart is ideal when time-sensitivity is the focus\n\nChoose your tracking method based on what criteria is important for your project. Mixing and using more than one over the course of the project is also an option!\nZooming out from the tasks and pausing to view the project as a whole can help to come up with some new ideas!\nProject status reports are handy for summarizing the current progress of a project. They generally consist of:\n\nProject name - should communicate the overall goal of the project\nDate\nSummary\nStatus\nMilestones and tasks - includes key accomplishments as well as upcoming milestones\nIssues\n\nUse ROAM categories (resolved, owned, accepted, mitigated) to organize the issues you encounter.\nTypes of changes:\n\nNew or changing dependencies\nChanging priorities\nCapacity and people\nLimitations on budget resources\nScope creep\nForce majeure (unforeseeable major crisis, ex. worker’s strike, pandemic)\n\nThese changes are measured against the triple constraint: budget, scope, and time.\nDependency management means… managing dependencies in order to make sure the project is completed successfully, within the budget, and on time.\nThe four steps you can take are:\n\nProper identification\nRecording dependencies - use a risk register\nContinuous monitoring and control\nEfficient communication\n\nIf your dependencies are met on time, your team is less likely to fall behind schedule. And if you tightly manage your scope, you are less likely to encounter changes to your budget or timeline.\nRisk exposure\nA way of measuring the potential future loss due to a specific activity or event.\nThis uses the probability-impact matrix.\nProblem solving\nEscalation- enlisting the help of higher level project leadership or management for an issue- is one of the ways of dealing with an obstacle. It should be used often and encouraged; communication is good!\n\nActs as a form of checks and balances\nGenerates speedy decision making\nReduces frustrations\nEncourages participation\n\nEscalations should be used at the first sign of a critical problem in a project.\nCritical problems\n\nCause a delay on a major milestone\nCause budget overruns\nCan result in the loss of a customer\nPush back the estimated project completion date\n\nEffective escalation\n\nMaintain a friendly tone\nState your connection to the project\nExplain the problem\nExplain the consequence\nMake a request\nBe sure to put some kind of required action in the subject of the email/message!\n\nTrench war\nIn the context of project management, it is a disagreement between two parties that refuse to give or compromise.\nSometimes you get a bad compromise, when two parties settle on a solution but the product still suffers. That’s why it’s important to get a satisfactory resolution and outcome for the disagreement and product respectively.\nChanges obviously need to be communicated, but how and with who is contextual. If you are informing just one or a few team members, usually an email will suffice.\nIf a big change impacts multiple people and affects the triple constraint, you will want to have a team meeting.\nSometimes it’s beneficial to take a time-out, get a little distance from the project, then reassess the situation and adjust the plan. It takes up time, but can be very worthwhile when things get complicated or frustrating.\nRetrospective\nA meeting focused on identifying the contributing causes of an incident or pattern of incidents without blaming any individual.\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-2---Quality-Management-and-Continuous-Improvement":{"slug":"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-2---Quality-Management-and-Continuous-Improvement","filePath":"Coursera/Google Project Management Course/Course 4 - Project Execution/Module 2 - Quality Management and Continuous Improvement.md","title":"Module 2 - Quality Management and Continuous Improvement","links":[],"tags":["project_management","coursera"],"content":"2025-08-06 18:09\nYou don’t want to stop at just calling a project done- the quality has to be there too.\nFor quality management, there are four main concepts:\n\nQuality standards\nQuality planning\nQuality assurance\nQuality control\nQuality standards\nClearly defined requirements, specifications, or guidelines that are used to ensure that whatever you do or make has the desired outcome\nDoing this correctly will result in less rework and schedule delays.\n\nSome examples are:\n\nReliability standards - expectations of team members or partners to be on time and well prepared for their responsibilities\nUsability standards - making sure the product fits the circumstances and needs of the client/user\nProduct standards - making sure that the product itself is made and operates to specifications\n\nQuality planning\nEstablishing a process for identifying and defining exactly which standards of quality are relevant to the project (and how to satisfy them)\nWhat outcome does the customer want?\nWhat does quality look like for them?\nHow can I meet their expectations?\nHow will I determine if the quality measures will lead to success?\nQuality assurance (QA)\nEvaluating if your project is moving towards delivering a high-quality service or product\nUnlike the previous two, this spans the whole project lifecycle. The focus of this is to prevent defects before they occur.\nQuality control (QC)\nMonitoring project results to determine if they are meeting desired outcomes\nThe focus of this is to correct defects after they occur.\nCommunication skills and fostering relationships\nCommunication breakdown happens in some form during most projects, even with time and care devoted to it. Handling communication tactfully will help develop trust and others’ confidence in your abilities. Some of the skills to do this are negotiation, empathetic listening, and trust building.\nFirst, a key tactic for each of these skills is asking questions. Open-ended questions and active listening will help you understand the other person’s current state and desired state., and what might help them get from the former to the latter.\nPracticing empathy is important for building relationships too. You may have your own way of doing it, and that is perfectly fine. Just remember you should always:\n\nShow you understand their frustrations\nAddress those frustrations\nFind a solution that benefits both of you\n\nIn order to find out what your customers want, you should ask them! Feedback surveys are one option for collecting information on your customers’ wants and likes.\nUser Acceptance Tests are another way of getting feedback. You’ll take the customer through a critical user journey, which is the sequence of steps a user follows to accomplish tasks in your product that you plan out yourself.\nUser acceptance test (UAT) agenda steps\n\nWelcome users and thank them for participating\nPresent your product to them\nStart UAT test cases\nWalk users through a demonstration\nIdentify edge cases\nThese typically pertain to software projects and deal with extreme minimums and maximums of parameters.\nRecap findings, identify issues, and prioritize which issues should be addressed first\n\nWhen collecting feedback, it’s good to keep accessibility in mind…\n\nOffer to provide accommodations before and during the survey/collection period\nExamine the space with an accessibility lens\nCheck that the systems you are using are fully accessible\nMake accessibility part of the conversation from the beginning\n\nIn a project management role, being able to empathize and understand how different people n the world will interact with your product is really important.\nContinuous improvement and process improvement\nContinuous improvement begins with recognition, specifically of when processes need to be created, eliminated, or improved.\nData driven improvement\nOperating by the framework of DMAIC (define, measure, analyze, improve, control), you can use the data you collect to drive changes and make more reliable improvements.\nPlan, Do, Check, Act (PDCA)\nA more streamlined four step process focusing on identifying the problem, applying a fix, assessing the results, and fine-tuning the final fix so that it fits the project moving forward as well.\nA program manager supervises a group of projects and focuses on long-term business objectives. A portfolio manager supervises company-wide changes while managing both projects and programs.\nRetrospectives can happen after major milestones, but typically are reserved for the end of the project. The purpose of retrospectives:\n\nEncourage team building\nFacilitate improved collaboration\nPromote positive changes\n\nIn short, the emphasis is on continuous improvement and change instead of recycling bad habits.\nYou want team members to feel comfortable sharing their feedback. People don’t want to participate in retrospectives if they feel like their feedback won’t be fully considered. Some other things to consider are:\n\nMaintain a positive tone\nAvoid assigning blame\nWhat went well, what could be improved, and where you got lucky\n\nA common way to structure retrospectives is:\n\nProject summary\nKey accomplishments\nLessons learned\nAction items\nFuture considerations\nResources\n\nThis is a great way not only to reflect on everything that happened throughout the project, but also make procedural changes and plan ahead for future projects.\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-3---Data-informed-Decision-making":{"slug":"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-3---Data-informed-Decision-making","filePath":"Coursera/Google Project Management Course/Course 4 - Project Execution/Module 3 - Data-informed Decision-making.md","title":"Module 3 - Data-informed Decision-making","links":[],"tags":["coursera","project_management"],"content":"2025-08-18 12:00\nThere are lots of ways to collect data today! Utilizing it can prevent both major and minor issues, as well as reach goals and success metrics.\nSpecifically, using data you can\n\nmake better decisions, informed and supported by facts\nsolve problems\nunderstand performance\nimprove processes\nunderstand your users\n\nMetrics\nProductivity metrics:\n\nMilestones\nTasks\nProjections\nDuration\n\nQuality metrics:\n\nNumber of changes\nIssues\nCost variance\n\nThere are also happiness metrics, adoption metrics, engagement metrics…\nBut which ones you will focus on will depend on your goals and feedback from stakeholders.\nData ethics\nSince data informs any major decisions made for a project, and these decisions can have wide-reaching and direct effects on people, companies abide by a set of ethics surrounding data.\nBusinesses apply data ethics so that they can…\n\nComply with regulations\nShow that they are trustworthy\nEnsure fair and reasonable data usage\nMinimize bias\nDevelop a positive public perception\n\nTwo examples of principles that data ethics are rooted in are data privacy and data bias.\nData privacy\nThis includes things like presenting the purpose of data collection and processing, privacy preferences of individuals, the way personal information is handled and shared, and the rights individuals have over their own data. Some ways to practice this are increasing awareness of data privacy in your company, using approved security tools, and anonymizing data for it to be freely shared.\nData bias\nThis refers mainly to the collection of data and making sure the method of collection does not introduce errors or false representations. This includes common biases found in other fields like sampling bias, observer bias, interpretation bias, and confirmation bias.\nAnalysis\nAfter finding out what data you need and collecting it, you still need to know how to process and interpret it!\nData analysis has six key steps:\n\nAsk\nAsking the right questions is important, especially making sure you are focusing on the core problem and not one of its symptoms. This also includes finding out what your stakeholders’ goals are.\nPrepare\nThis is collecting and storing the data you need.\nProcess\nCleaning the data, which involves things like arranging, categorizing, checking for duplicates, biased or invalid responses, as well as typos or other errors.\nAnalyze\nBreaking the data down to draw conclusions from it. This is often emphasized with a chart, graph, or some other way of visualizing the data to illustrate your point.\nShare\nThis is presenting your findings to your team, stakeholders, and sponsors. The graphs come in handy here!\nAct\nThe business/company takes action and implements changes based on the data you have gathered and analyzed.\n\nPresentation\nStories are a major part of the human experience- they are how we form the framework for our understanding of the world. Project managers use data to tell stories, and in order to be effective, those stories must be complete, accurate, and compelling.\nSix steps to storytelling:\n\nDefine your audience\nCollect the data\nFilter and analyze the data\nChoose a visual representation\nShape the story\nGather your feedback\n\nVisualization tools help\n\nfilter your information by focusing the audience on the most important data points and insights\ncondense long ideas and facts into a single image or representation\nmake sense of the information being presented\n\nYou can use bar graphs, line graphs, pie charts, and more, but keep them simple! Don’t overload them with too much text or too many different elements. (Should be understandable in about 5 seconds)\nSome other key points to keep in mind are\n\nIdentify the problem you are solving for your audience, and remove content that dilutes your narrative\nConsider the time you have and your approach if you might have to shorten the presentation\nIdentify potential questions and objections, and come up with answers ahead of time\nBe memorable! Also pay attention to body language.\n\nIt’s important to review your presentation for accessibility as well.\n\nCreate clear, simple slides\nAdd alt text for images, drawings, and graphics\nUse text for critical information\nProvide captions if you have audio or video recordings\nFor contrast and text size, more is better (ideal contrast ratio is 7:1) (also avoid using all caps)\nShare contents in advance, or at least an outline. Glossary might help too!\n\nReference\ncoursera.org"},"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-4--Teamwork-and-Influencing-Skills":{"slug":"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-4--Teamwork-and-Influencing-Skills","filePath":"Coursera/Google Project Management Course/Course 4 - Project Execution/Module 4- Teamwork and Influencing Skills.md","title":"Module 4- Teamwork and Influencing Skills","links":[],"tags":["project_management","coursera"],"content":"2025-08-27 11:16\nThe hallmark of great leadership is not only developing a good plan and being responsive and proactive, but also inspiring their teammates and getting them to work well together.\nBut first… what exactly is a “team?”\nA group of people who plan, solve problems, make decisions, and review progress in service of a specific project or objective\nNot to be confused with a “work group”:\nPeople in an organization who work towards a common goal. Work groups are more likely to be coordinated, controlled, or assigned by a single person or entity.\nTeamwork\nAn effective, collaborative way of working in which each person is committed to heading towards a shared goal\nEffective and Ethical Leadership\nFive factors that impact team effectiveness:\n\nPsychological safety\nAn individual’s perception of the consequences of taking an interpersonal risk. This involves taking risks around teammates, seeking differing opinions, and resolving interpersonal conflicts when they arise. Google team: “Be direct and kind.”\nDependability\nTeam members are reliable, complete their work on time, and meet expectations.\nStructure and clarity\nAn individual’s understanding of expectations, knowledge of how to meet those expectations, and the consequences of their performance.\nMeaning\nFinding a sense of purpose either in the work itself or the results of that work\nImpact\nThe belief that the results of one’s work matter and create change\n\nEffective team leaders\n\ncreate systems that turn chaos into order\ncommunicate and listen\npromote trust and psychological safety\ndemonstrate empathy and create motivation\ndelegate responsibility and prioritize\ncelebrate team success\n\nSometimes you need to prioritize the needs of your team over the wants of your stakeholders- this is called air cover. It refers to situations where you provide support and protection to your team from out-of-scope requests or criticism from leadership. This obviously comes with some risk, so make sure you are prepared.\nThere may be cases where you’ll want to spare your team the stress of unreasonable requests so that they can focus on their work. You can consult with just a few team members you trust to brainstorm ways to address the situation.\nBruce Tuckman’s stages of team development\n\nForming\nTeam gets to know one another, and the PM clarifies goals, roles, and context for the project\nStorming\nConflict and frustration emerges, and the PM handles conflict resolution and helps lead the team to better function as a unit\nNorming\nConflicts are mostly resolved and the team is functioning, while the PM codifies the team norms (and reinforces them when needed) and makes sure everyone on the team is aware of them\nPerforming\nThe team works together seamlessly, while the PM focuses on delegating, motivating, and providing feedback to maintain momentum\nAdjourning\nProject wraps up, team disbands and celebrates final milestone success. The PM makes sure each team member knows what’s next for them.\n\nEthical leadership promotes and values honesty, justice, respect, community, and integrity.\nYou can promote this by defining and aligning values with your team, and demonstrating how adhering to those values benefits the mission of the organization.\nFramework for ethical decision making\n\nRecognize an ethical issue\nGet the facts\nEvaluate alternative actions\nMake a decision and test it\nAct and reflect on the outcome\n\nInfluencing\nAs a project manager, you want to be able to influence your teammates go perform their best and make sure\nSteps for effective influencing:\n\nEstablish credibility - this is dependent on expertise and relationships\nFrame for common ground - make the case for how your idea can benefit your audience\nProvide evidence - make your case through numbers and strong storytelling\nConnect emotionally - demonstrate that you have shared goals and values\n\nCommon mistakes when trying to influence others:\n\nApproaching the audience aggressively\nResisting compromise\nFailing to establish credibility, common ground, or emotional connection\nAssume an agreement can be worked out though a single conversation\n\nApproach isn’t the only factor in influence. The other major ones are organizational and personal.\nOrganizational sources of power:\n\nRole\nInformation (level of access and control)\nNetwork\nReputation\n\nPersonal sources of power:\n\nKnowledge\nExpressiveness\nHistory (between you and another person)\nCharacter\n\nThese can be thought of as your “superpowers.” Pay attention to your own sources of power and try to identify which is your super power!\nReference\ncoursera.org, my brain"},"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-5---Effective-Project-Communication":{"slug":"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-5---Effective-Project-Communication","filePath":"Coursera/Google Project Management Course/Course 4 - Project Execution/Module 5 - Effective Project Communication.md","title":"Module 5 - Effective Project Communication","links":[],"tags":["project_management","coursera"],"content":"2025-08-31 11:40\nThroughout projects, as the project manager you will need to communicate certain information multiple times and in various ways. Different people learn in different ways. That’s just how it is!\nReinforce important information multiple times in multiple different ways to make sure everyone is in the loop.\nTips for email writing:\n\nState what you want clearly.\n\nInclude request in the subject line\nState request within first two paragraphs\nIndicate a specific call-to-action in your request\nWrite clear concise sentences when providing details\nDefine terms and avoid acronyms or terminology that users may not know.\n\n\nKeep the content short and concise.\n\nSummarize the content you want to convey\nAim for your email to be “questionless” and “self-standing”\nKnow your audience, and tailor accordingly\n\n\nStructure your writing.\n\nUse bullets, labels, etc.\nAdd hyperlinks\nWrite strong topic sentences (place the main idea of the paragraph in its first sentence)\n\n\nCheck grammar, punctuation, and spelling.\n\nWe all get lots of emails a day, so here are some best practices:\n\nCarefully select who you’re sending emails to and why\nMake sure the subject field clearly previews what the email is about\nKeep messages as short as possible and stay on topic\nAttach or link large amounts of information separately\nClearly state action items\nUse correct grammar, spelling, and clear/common terminology only\nWrite in an appropriate tone\n\nInstant messaging apps might be more appropriate for quick, short, or urgent communication. But it’s always best to determine the best way to communicate on an individual basis!\nEffective meetings are\n\nStructured\n\nStart and end on time\nCarefully selected attendees\nPrioritized topics\nDesignated notetakers\n\n\nIntentional\n\nClearly stated purpose and expectations (in meeting agenda and subject line)\nEveryone understands why they’re meeting\n\n\nCollaborative\n\nMake it clear that attendee’s input is valued and needed\nAllow for people to respond to the meeting in their preferred method\n\n\nInclusive\n\nHelp participants feel comfortable sharing different perspectives\nDo things like appoint a moderator to handle attendee questions\nLeave space in the meeting for participants who have been quiet\nAccommodate for disabilities or impairments\n\n\n\nGoogle’s study shows that productive meetings have three things in common:\n\nActive participation from attendees\nA clear and concise agenda that is followed through\nThe correct attendees, meaning the participants can contribute to achieving the meeting’s goal\n\nThere are generally four types of meetings:\n\nProject kick-offs\nStatus updates\nStakeholder reviews\nProject reviews\n\n\nReference\ncoursera.org!"},"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-6---Closing-a-Project":{"slug":"Coursera/Google-Project-Management-Course/Course-4---Project-Execution/Module-6---Closing-a-Project","filePath":"Coursera/Google Project Management Course/Course 4 - Project Execution/Module 6 - Closing a Project.md","title":"Module 6 - Closing a Project","links":[],"tags":["coursera","project_management"],"content":"2025-09-09 17:09\nClosing a project means\n\nAssuring all work is done\nAgreed upon project management process are executed\nStakeholders formally recognize and agree that the project is done\n\nIf some tasks or deliverables cannot be completed, you may end up with a never-ending project.\nOn the other hand, if you have inadequate handoff or transition on the project’s deliverables, you get an abandoned project.\nYou may want to consider whether smaller closing processes for each milestone may be more fitting for your project, or whether it would be better to have a single large one at the end.\nSteps to conducting a closing process after each phase/milestone:\n\nRefer back to prior documentation\n\nStatement of work\nRequest for Proposal\nRisk register\nRACI chart\n\n\nPut together closing documentation\nConduct administrative closure of the procurement process\nMake sure all stakeholders are aware of the phase/project’s closure\nExecute necessary follow-up work\n\nFor conducting the closing process at the end:\n\nProvide necessary training, tools, documentation, and capability to use your project\nEnsure that the project has satisfied its goals and desired outcomes\nDocument acceptance from all stakeholders\nReview all contracts and documentation\nConduct a formal retrospective\nDisband and thank the project team\n\nImpact reporting\nA presentation given at the end of a project for key stakeholders to demonstrate how the project went and its success\nRetrospectives encourage team building, facilitate improved collaboration, and promote positive changes.\nProject Closeout Report\n\nServes as a blueprint to document what the team did and how, and what they delivered\nProvides and evaluation of the quality of work\nEvaluates a project’s performance with respect to budget and schedule\n\nReference"},"Coursera/Google-Project-Management-Course/index":{"slug":"Coursera/Google-Project-Management-Course/index","filePath":"Coursera/Google Project Management Course/index.md","title":"Google Project Management Course","links":["Coursera/Google-Project-Management-Course/Course-1---Foundations-of-Project-Management/Module-2---Core-Skills"],"tags":[],"content":"Module 2 - Core Skills"},"index":{"slug":"index","filePath":"index.md","title":"My Site","links":["Coursera/Google-Project-Management-Course/Course-1---Foundations-of-Project-Management/Module-1---Intro-to-Project-Management"],"tags":[],"content":"2025-06-19 12:35\nModule 1 - Intro to Project Management\nReference"}}